In [1]:
person = {
    "first" : "Corey",
    "last"  : "Schafer",
    "email" : "CoreyMSchafer@gmail.com"
}

In [2]:
people = {
    "first" : ["Corey"],
    "last"  : ["Schafer"],
    "email" : ["CoreMSchafer@gmail.com"]
}

In [3]:
people = {
    "first" : ["Corey", 'Jane', 'Jhon', 'Adam'],
    "last"  : ['Schafer', 'Doe', 'Doe', 'Doe'],
    "email" : ['CoreyMSchafer@gmail.com', 'JaneDoe@gmail.com', 'JhonDoe@gmail.com', 'AdanDoe@gmail.com']
}

In [4]:
people['email']

['CoreyMSchafer@gmail.com',
 'JaneDoe@gmail.com',
 'JhonDoe@gmail.com',
 'AdanDoe@gmail.com']

In [5]:
import pandas as pd
import numpy as np

In [6]:
df = pd.DataFrame(people)

In [7]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   Jhon      Doe        JhonDoe@gmail.com
3   Adam      Doe        AdanDoe@gmail.com

Here we specify what is a dataframe, it is a 2 dimensional structure, that means that it is a structure composed by rows and columns. We give as many columns and rows as the data from where we create or extract the df (dataframe), in the df we have described as people, the df has 3 rows and 3 columns, because those where the number of keys and the number of elements inside the dictionary.

In [8]:
df['email']

0    CoreyMSchafer@gmail.com
1          JaneDoe@gmail.com
2          JhonDoe@gmail.com
3          AdanDoe@gmail.com
Name: email, dtype: object

In [9]:
type(df['email'])

pandas.core.series.Series

A series is a 1 dimensional array, it is rows of data, the example is df['email'], which shows 3 rows of data, another way to get the same information is to do df.email, as is shown. There are advantages when using the first methodology, because when using ['zzz'], you are calling the single column under that name, but, if the name of the column is the same as some method, like 'count', only ['zzz'] would work, since df.count would access the method, not the column.

In [10]:
df.email

0    CoreyMSchafer@gmail.com
1          JaneDoe@gmail.com
2          JhonDoe@gmail.com
3          AdanDoe@gmail.com
Name: email, dtype: object

In [11]:
df[['last','email']]

      last                    email
0  Schafer  CoreyMSchafer@gmail.com
1      Doe        JaneDoe@gmail.com
2      Doe        JhonDoe@gmail.com
3      Doe        AdanDoe@gmail.com

When accesing multiple columns, the calling is df[['list']], since the first [] works as what's gonna be called, and the inner [] works as the list of columns we are calling. Also, the output is a filtered df, since the output is a 2 dimensional structure, with different kinds of data in it.

In [12]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [13]:
df.iloc[0]

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [14]:
df.iloc[[0,1]]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com

In [15]:
df.iloc[[0,1],2]

0    CoreyMSchafer@gmail.com
1          JaneDoe@gmail.com
Name: email, dtype: object

In [16]:
df.iloc[[0,1],[2]]

                     email
0  CoreyMSchafer@gmail.com
1        JaneDoe@gmail.com

In [17]:
df.loc[0]

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [18]:
df.loc[[0,1],'last']

0    Schafer
1        Doe
Name: last, dtype: object

In [19]:
df.loc[[0,1],['email','last']]

                     email     last
0  CoreyMSchafer@gmail.com  Schafer
1        JaneDoe@gmail.com      Doe

Now, accessing rows could be done two ways, with iloc, or with loc, the first of these methods takes only integers, (that's why the 'i' in iloc), while the second method takes indexes, that mean that for example, for the columns, you can't as for the column 2 as you would do in iloc, but for the column 'email'. When accessing multiple rows, or multiple rows and columns, you write them in a list inside the method, and you cant write them in the order you want, because these methods create a new dataframe, with the rows as you've told it to have and the rows you'told it to have, in the express order you've said. That means that like above, you can call the column 'email' before the column 'last', independent of the order the had in the first df.

In [20]:
df.loc[[1,0,2,1,1],['last','email','first','email','last']]

      last                    email  first                    email     last
1      Doe        JaneDoe@gmail.com   Jane        JaneDoe@gmail.com      Doe
0  Schafer  CoreyMSchafer@gmail.com  Corey  CoreyMSchafer@gmail.com  Schafer
2      Doe        JhonDoe@gmail.com   Jhon        JhonDoe@gmail.com      Doe
1      Doe        JaneDoe@gmail.com   Jane        JaneDoe@gmail.com      Doe
1      Doe        JaneDoe@gmail.com   Jane        JaneDoe@gmail.com      Doe

In [21]:
df.set_index('email')

                         first     last
email
CoreyMSchafer@gmail.com  Corey  Schafer
JaneDoe@gmail.com         Jane      Doe
JhonDoe@gmail.com         Jhon      Doe
AdanDoe@gmail.com         Adam      Doe

In [22]:
df.set_index('email',inplace = True)

In [23]:
df

                         first     last
email
CoreyMSchafer@gmail.com  Corey  Schafer
JaneDoe@gmail.com         Jane      Doe
JhonDoe@gmail.com         Jhon      Doe
AdanDoe@gmail.com         Adam      Doe

In [24]:
df.index

Index(['CoreyMSchafer@gmail.com', 'JaneDoe@gmail.com', 'JhonDoe@gmail.com',
       'AdanDoe@gmail.com'],
      dtype='object', name='email')

In [25]:
df.loc['CoreyMSchafer@gmail.com', 'last']

'Schafer'

In [26]:
df.iloc[0]

first      Corey
last     Schafer
Name: CoreyMSchafer@gmail.com, dtype: object

In [27]:
df.reset_index(inplace=True)
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JhonDoe@gmail.com   Jhon      Doe
3        AdanDoe@gmail.com   Adam      Doe

What we've done here is sustituting the indexes of the dataframe, when we first created it, it had index 0, 1, 2 and that's what we gave to the method loc in order to get a row, but sometimes, it is more usefull to have an important characteristic, so we switch the index with set_index, but, if we do not give the function the argument inplace=True, the switch will not be permanently, it will only show one time the new index. Then, once we hace switched the index, for using loc we have to call a row by its index, that is no longer a integer.

In [28]:
filt_1 = (df['last'] == 'Doe')
filt_2 = df['last'] != 'Doe'
filt_1

0    False
1     True
2     True
3     True
Name: last, dtype: bool

In [29]:
df[filt_1]

               email first last
1  JaneDoe@gmail.com  Jane  Doe
2  JhonDoe@gmail.com  Jhon  Doe
3  AdanDoe@gmail.com  Adam  Doe

In [30]:
filt_2

0     True
1    False
2    False
3    False
Name: last, dtype: bool

This way, we create a variable that filters the parameter we want, in this case, we want to filter whose last name is 'Doe', but we also can filter whose last name is not 'Doe' (represented as filt_2), and then we can show it as a df. We also can use the criteria inside of the df[zzz], instead of defining a variable that meets the criteria, it would look like; df[df['last'] == 'Doe']. We can also use the method .loc with the filters, and using  filter with this method we can combine it with selecting one (or more) columns to show from the rows that match the filter. We can add requisites in the filter with & and giving options for the filter (option1 OR option2) with | (upside bar). We can negate (get the opposite) of  filter with -(name of filter variable). We can also use operators like < >.

In [31]:
df.loc[filt_1]

               email first last
1  JaneDoe@gmail.com  Jane  Doe
2  JhonDoe@gmail.com  Jhon  Doe
3  AdanDoe@gmail.com  Adam  Doe

In [32]:
df.loc[filt_1,'email']

1    JaneDoe@gmail.com
2    JhonDoe@gmail.com
3    AdanDoe@gmail.com
Name: email, dtype: object

In [33]:
filt_3 = (df['last'] == 'Doe') & (df['first'] == 'Jhon')
df.loc[filt_3, 'email']

2    JhonDoe@gmail.com
Name: email, dtype: object

In [34]:
filt_4 = (df['last'] == 'Schafer') | (df['first'] == 'Jhon')
df.loc[-filt_4]

               email first last
1  JaneDoe@gmail.com  Jane  Doe
3  AdanDoe@gmail.com  Adam  Doe

In [35]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [36]:
df.columns = ['email', 'first name', 'last name']
df

                     email first name last name
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@gmail.com       Jane       Doe
2        JhonDoe@gmail.com       Jhon       Doe
3        AdanDoe@gmail.com       Adam       Doe

In [37]:
df.columns = [x.upper() for x in df.columns]
df

                     EMAIL FIRST NAME LAST NAME
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@gmail.com       Jane       Doe
2        JhonDoe@gmail.com       Jhon       Doe
3        AdanDoe@gmail.com       Adam       Doe

In [38]:
df.columns = df.columns.str.replace(' ', '_')
df

                     EMAIL FIRST_NAME LAST_NAME
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@gmail.com       Jane       Doe
2        JhonDoe@gmail.com       Jhon       Doe
3        AdanDoe@gmail.com       Adam       Doe

In [39]:
df.columns = [x.lower() for x in df.columns]
df

                     email first_name last_name
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@gmail.com       Jane       Doe
2        JhonDoe@gmail.com       Jhon       Doe
3        AdanDoe@gmail.com       Adam       Doe

In [40]:
df.rename(columns = {'first_name' : 'first', 'last_name' : 'last'}, inplace = True)
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JhonDoe@gmail.com   Jhon      Doe
3        AdanDoe@gmail.com   Adam      Doe

In [41]:
df.loc[2] = ['JhonSmith@gmail.com', 'Jhon', 'Smith']
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2      JhonSmith@gmail.com   Jhon    Smith
3        AdanDoe@gmail.com   Adam      Doe

In [42]:
df.loc[2, ['last', 'email']] = ['Doe', 'JhonDoe@gmail.com']
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JhonDoe@gmail.com   Jhon      Doe
3        AdanDoe@gmail.com   Adam      Doe

In [43]:
df.loc[2, 'last'] = 'Smith'
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JhonDoe@gmail.com   Jhon    Smith
3        AdanDoe@gmail.com   Adam      Doe

In [44]:
df.at[2, 'last'] = 'Doe'
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JhonDoe@gmail.com   Jhon      Doe
3        AdanDoe@gmail.com   Adam      Doe

In [45]:
df['email'].str.lower() #Just a temporary solution to seeing all the values in the column 'email' lowered.

0    coreymschafer@gmail.com
1          janedoe@gmail.com
2          jhondoe@gmail.com
3          adandoe@gmail.com
Name: email, dtype: object

In [46]:
df['email'] = df['email'].str.lower() #This is the permanent method
df

                     email  first     last
0  coreymschafer@gmail.com  Corey  Schafer
1        janedoe@gmail.com   Jane      Doe
2        jhondoe@gmail.com   Jhon      Doe
3        adandoe@gmail.com   Adam      Doe

In [47]:
#Apply method. It lets you pass a function to data in order to transform said data temporaly or permanently.
df['email'].apply(len)

0    23
1    17
2    17
3    17
Name: email, dtype: int64

In [48]:
def update_email (email):
    return email.upper()

In [49]:
#Example with a created function for a temporary change.
df['email'].apply(update_email)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@GMAIL.COM
2          JHONDOE@GMAIL.COM
3          ADANDOE@GMAIL.COM
Name: email, dtype: object

In [50]:
#Example with created function for a permanent change.
df['email'] = df['email'].apply(update_email)
df

                     email  first     last
0  COREYMSCHAFER@GMAIL.COM  Corey  Schafer
1        JANEDOE@GMAIL.COM   Jane      Doe
2        JHONDOE@GMAIL.COM   Jhon      Doe
3        ADANDOE@GMAIL.COM   Adam      Doe

In [51]:
#Example with a lambda function. Here, the x is the email values.
df['email'] = df['email'].apply(lambda x: x.lower())
df

                     email  first     last
0  coreymschafer@gmail.com  Corey  Schafer
1        janedoe@gmail.com   Jane      Doe
2        jhondoe@gmail.com   Jhon      Doe
3        adandoe@gmail.com   Adam      Doe

In [52]:
df.apply(len)

email    4
first    4
last     4
dtype: int64

In [53]:
#In this case, we apply the function given to the method apply to all the data frame, but it counts the lenght of the series in every column,
#i.e. the number of elements each column has. (axis = 'rows') is the default setting
df.apply(len, axis = 'columns')

0    3
1    3
2    3
3    3
dtype: int64

In [54]:
#In this example, we are telling the df to return the minimum value of every column, in columns that are a aarraay of strings (characters),
#we get the alphabetical order.
df.apply(pd.Series.min)

email    adandoe@gmail.com
first                 Adam
last                   Doe
dtype: object

In [55]:
#Here, the x of the lambda is a series, not a value.
df.apply(lambda x: x.min())

email    adandoe@gmail.com
first                 Adam
last                   Doe
dtype: object

Running apply on a series applies a function to every value in the series, and running apply to a dataframe apply a function to every series in the dataframe. map is a method that works in dataframes as apply, but applies the function to every value in the dataframe. map also works on series.

In [56]:
df.map(len)

   email  first  last
0     23      5     7
1     17      4     3
2     17      4     3
3     17      4     3

In [57]:
df.map(str.lower)

                     email  first     last
0  coreymschafer@gmail.com  corey  schafer
1        janedoe@gmail.com   jane      doe
2        jhondoe@gmail.com   jhon      doe
3        adandoe@gmail.com   adam      doe

In [58]:
#In cases of changing values of data with map, the values we don't change convert to NaN, in this case, the column first, we change two values,
#but not the third, so the third becomes NaN. A more apt method for this is replace
df['first'].map({'Corey': 'Chris', 'Jane':'Mary'})

0    Chris
1     Mary
2      NaN
3      NaN
Name: first, dtype: object

In [59]:
df['first'].replace({'Corey': 'Chris', 'Jane':'Mary'})

0    Chris
1     Mary
2     Jhon
3     Adam
Name: first, dtype: object

In [60]:
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2         Jhon Doe
3         Adam Doe
dtype: object

In [61]:
df['full_name'] = df['first'] + ' ' + df['last']
df

                     email  first     last      full_name
0  coreymschafer@gmail.com  Corey  Schafer  Corey Schafer
1        janedoe@gmail.com   Jane      Doe       Jane Doe
2        jhondoe@gmail.com   Jhon      Doe       Jhon Doe
3        adandoe@gmail.com   Adam      Doe       Adam Doe

In [62]:
df.drop(columns = ['first', 'last'], inplace = True)
df

                     email      full_name
0  coreymschafer@gmail.com  Corey Schafer
1        janedoe@gmail.com       Jane Doe
2        jhondoe@gmail.com       Jhon Doe
3        adandoe@gmail.com       Adam Doe

In [63]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand = True)
df

                     email      full_name  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@gmail.com       Jane Doe   Jane      Doe
2        jhondoe@gmail.com       Jhon Doe   Jhon      Doe
3        adandoe@gmail.com       Adam Doe   Adam      Doe

In [64]:
pd.concat([df, pd.DataFrame({'first' : ['Tony']})], ignore_index = True)

                     email      full_name  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@gmail.com       Jane Doe   Jane      Doe
2        jhondoe@gmail.com       Jhon Doe   Jhon      Doe
3        adandoe@gmail.com       Adam Doe   Adam      Doe
4                      NaN            NaN   Tony      NaN

Here we have a method for adding new rows, in order to not get an error when working with scalars, you need to pass a list as the values for a column, in this case, the list has only 1 value. The values of the columns for which you don't have determined a value is NaN. The ignore_index argument works as follows, if False (default) starts from 0, if True, continues the precedent index.

In [65]:
people = {
    "first" : ["Tony", 'Steve'],
    "last"  : ['Stark', 'Rogers'],
    "email" : ['IronMan@avenger.com', 'Cap@avenger.com']
}
df2 = pd.DataFrame(people)
df2

   first    last                email
0   Tony   Stark  IronMan@avenger.com
1  Steve  Rogers      Cap@avenger.com

In [66]:
df = pd.concat([df,df2], ignore_index=True)

In [67]:
df.drop(index = 4)

                     email      full_name  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@gmail.com       Jane Doe   Jane      Doe
2        jhondoe@gmail.com       Jhon Doe   Jhon      Doe
3        adandoe@gmail.com       Adam Doe   Adam      Doe
5          Cap@avenger.com            NaN  Steve   Rogers

In [68]:
filt = df['last'] == 'Doe'
df.drop(index = df[filt].index)

                     email      full_name  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
4      IronMan@avenger.com            NaN   Tony    Stark
5          Cap@avenger.com            NaN  Steve   Rogers

In [69]:
df.sort_values(by = 'last', ascending = False)

                     email      full_name  first     last
4      IronMan@avenger.com            NaN   Tony    Stark
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
5          Cap@avenger.com            NaN  Steve   Rogers
1        janedoe@gmail.com       Jane Doe   Jane      Doe
2        jhondoe@gmail.com       Jhon Doe   Jhon      Doe
3        adandoe@gmail.com       Adam Doe   Adam      Doe

In [70]:
df.sort_values(by = ['last', 'first'], ascending = False)

                     email      full_name  first     last
4      IronMan@avenger.com            NaN   Tony    Stark
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
5          Cap@avenger.com            NaN  Steve   Rogers
2        jhondoe@gmail.com       Jhon Doe   Jhon      Doe
1        janedoe@gmail.com       Jane Doe   Jane      Doe
3        adandoe@gmail.com       Adam Doe   Adam      Doe

In [71]:
df.sort_values(by = ['last', 'first'], ascending = [False, True], inplace = True) 
df

                     email      full_name  first     last
4      IronMan@avenger.com            NaN   Tony    Stark
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
5          Cap@avenger.com            NaN  Steve   Rogers
3        adandoe@gmail.com       Adam Doe   Adam      Doe
1        janedoe@gmail.com       Jane Doe   Jane      Doe
2        jhondoe@gmail.com       Jhon Doe   Jhon      Doe

In [72]:
df.sort_index()

                     email      full_name  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@gmail.com       Jane Doe   Jane      Doe
2        jhondoe@gmail.com       Jhon Doe   Jhon      Doe
3        adandoe@gmail.com       Adam Doe   Adam      Doe
4      IronMan@avenger.com            NaN   Tony    Stark
5          Cap@avenger.com            NaN  Steve   Rogers

In [73]:
df['last'].sort_values()

3        Doe
1        Doe
2        Doe
5     Rogers
0    Schafer
4      Stark
Name: last, dtype: object

In [74]:
people_1 = {
    "first" : ["Corey", 'Jane', 'Jhon', 'Adam', np.nan, None, 'NA'],
    "last"  : ['Schafer', 'Doe', 'Doe', 'Doe', np.nan, np.nan, 'Missing'],
    "email" : ['CoreyMSchafer@gmail.com', 'JaneDoe@gmail.com', 'JhonDoe@gmail.com', 'AdanDoe@gmail.com', None, 'Anonimys@gmail.com', 'NA'],
    'age'   : ['33', '55', '63', '36', None, None, 'Missing']
}

In [75]:
df_1 = pd.DataFrame(people_1)
df_1

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@gmail.com       55
2   Jhon      Doe        JhonDoe@gmail.com       63
3   Adam      Doe        AdanDoe@gmail.com       36
4    NaN      NaN                     None     None
5   None      NaN       Anonimys@gmail.com     None
6     NA  Missing                       NA  Missing

In [76]:
df_1.dropna(axis = 'index', how = 'any') #if how = 'all' it will only drop the rows or columns whose whole values are NaN

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@gmail.com       55
2   Jhon      Doe        JhonDoe@gmail.com       63
3   Adam      Doe        AdanDoe@gmail.com       36
6     NA  Missing                       NA  Missing

In [77]:
df_1.dropna(axis = 'columns', how = 'any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [78]:
df_1.dropna(axis = 'index', how = 'all', subset = ['email', 'last']) #In this case, if all is the how, it will drop rows whose values in email and last are both NaN

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@gmail.com       55
2   Jhon      Doe        JhonDoe@gmail.com       63
3   Adam      Doe        AdanDoe@gmail.com       36
5   None      NaN       Anonimys@gmail.com     None
6     NA  Missing                       NA  Missing

In [79]:
df_1.fillna('MISSING')

     first     last                    email      age
0    Corey  Schafer  CoreyMSchafer@gmail.com       33
1     Jane      Doe        JaneDoe@gmail.com       55
2     Jhon      Doe        JhonDoe@gmail.com       63
3     Adam      Doe        AdanDoe@gmail.com       36
4  MISSING  MISSING                  MISSING  MISSING
5  MISSING  MISSING       Anonimys@gmail.com  MISSING
6       NA  Missing                       NA  Missing

In [80]:
df_1.dtypes #Age here is a string, not integers, we have to convert them

first    object
last     object
email    object
age      object
dtype: object

In [81]:
#In order to not have to replace every custom non-value, such as NA or Missing, we would create a list with those values and replace said list. e.g. na_values = ['NA', 'Missing'] 

df_1.fillna(0, inplace = True)
df_1.replace(to_replace = {'NA' : 0, 'Missing' : 0}, inplace = True)
df_1['age'] = df_1['age'].astype(float)
df_1['age'].median()

33.0